Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 224, 224, 32)      2432      
_________________________________________________________________
batch_normalization_12 (Batc (None, 224, 224, 32)      128       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 224, 224, 32)      9248      
_________________________________________________________________
batch_normalization_13 (Batc (None, 224, 224, 32)      128       
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 112, 112, 32)      0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 112, 112, 32)      9248      
_________________________________________________________________
batch_normalization_14 (Batc (None, 112, 112, 32)      128       
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 112, 112, 32)      9248      
_________________________________________________________________
batch_normalization_15 (Batc (None, 112, 112, 32)      128       
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 56, 56, 32)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 56, 56, 64)        18496     
_________________________________________________________________
batch_normalization_16 (Batc (None, 56, 56, 64)        256       
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 56, 56, 64)        36928     
_________________________________________________________________
batch_normalization_17 (Batc (None, 56, 56, 64)        256       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 28, 28, 64)        0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 28, 28, 128)       73856     
_________________________________________________________________
batch_normalization_18 (Batc (None, 28, 28, 128)       512       
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 28, 28, 128)       147584    
_________________________________________________________________
batch_normalization_19 (Batc (None, 28, 28, 128)       512       
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 14, 14, 128)       0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 14, 14, 128)       147584    
_________________________________________________________________
batch_normalization_20 (Batc (None, 14, 14, 128)       512       
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 14, 14, 128)       147584    
_________________________________________________________________
batch_normalization_21 (Batc (None, 14, 14, 128)       512       
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 7, 7, 256)         295168    
_________________________________________________________________
batch_normalization_22 (Batc (None, 7, 7, 256)         1024      
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 7, 7, 256)         590080    
_________________________________________________________________
batch_normalization_23 (Batc (None, 7, 7, 256)         1024      
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 3, 3, 256)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2304)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 512)               1180160   
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                32832     
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 65        
=================================================================
Total params: 2,705,633
Trainable params: 2,703,073
Non-trainable params: 2,560
_________________________________________________________________
